cf/Catalogs/Грузополучатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Грузополучатели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/ОсновнойГрузополучатель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновнойГрузополучатель</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грузополучатели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Грузополучатели/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Владелец = Параметры.Отбор.Владелец;
		Элементы.ФормаСоздатьНаОснованииВладельца.Видимость = Истина;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура СделатьОсновнымНаСервере()
	Если Элементы.Список.ТекущаяСтрока<>Неопределено Тогда
		РегЗапись = РегистрыСведений.ОсновнойГрузополучатель.СоздатьМенеджерЗаписи();
		РегЗапись.Контрагент = Элементы.Список.ТекущаяСтрока.Владелец;
		РегЗапись.Грузополучатель = Элементы.Список.ТекущаяСтрока.Ссылка;
		РегЗапись.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновным(Команда)
	СделатьОсновнымНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииВладельца(Команда)
	Если Владелец.Пустая() Тогда
		Возврат;
	КонецЕсли;
	СоздатьГрузополучателяСервер(Владелец);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьГрузополучателяСервер(Владелец)
	Справочники.Грузополучатели.СоздатьГрузополучателяПоВладельцу(Владелец,Владелец);
КонецПроцедуры

&НаСервере
Процедура УбратьОсновныхНаСервере()
	Если Элементы.Список.ТекущаяСтрока<>Неопределено Тогда
		Рег = РегистрыСведений.ОсновнойГрузополучатель.СоздатьНаборЗаписей();
		Рег.Отбор.Контрагент.Установить(Элементы.Список.ТекущаяСтрока.Владелец);
		Рег.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УбратьОсновных(Команда)
	УбратьОсновныхНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
